# Module 1 - Manipulating data with Pandas
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.

#### _Our goals today are to be able to_: <br/>

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use mean, min, max, and value_counts 
- Use apply and applymap to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a groupby object is and split a DataFrame using a groupby
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls -al data
# look at files in our folder

/Users/flatironschooldc2/Documents/GitHub/dc-ds-111819/module-1/day-6-pandas-3
total 40
drwxr-xr-x  5 flatironschooldc2  staff    160 Nov 25 09:36 .
drwxr-xr-x  5 flatironschooldc2  staff    160 Nov 25 10:09 ..
-rw-r--r--  1 flatironschooldc2  staff     95 Nov 25 09:36 ds_chars.csv
-rwxr-xr-x  1 flatironschooldc2  staff  11328 Nov 25 09:36 heart.csv
-rw-r--r--  1 flatironschooldc2  staff    130 Nov 25 09:36 states.csv

In [2]:
import pandas as pd
uci = pd.read_csv('data/heart.csv')

In [3]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [4]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [5]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [6]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [7]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe().T

          count        mean        std    min    25%    50%    75%    max
age       303.0   54.366337   9.082101   29.0   47.5   55.0   61.0   77.0
sex       303.0    0.683168   0.466011    0.0    0.0    1.0    1.0    1.0
cp        303.0    0.966997   1.032052    0.0    0.0    1.0    2.0    3.0
trestbps  303.0  131.623762  17.538143   94.0  120.0  130.0  140.0  200.0
chol      303.0  246.264026  51.830751  126.0  211.0  240.0  274.5  564.0
fbs       303.0    0.148515   0.356198    0.0    0.0    0.0    0.0    1.0
restecg   303.0    0.528053   0.525860    0.0    0.0    1.0    1.0    2.0
thalach   303.0  149.646865  22.905161   71.0  133.5  153.0  166.0  202.0
exang     303.0    0.326733   0.469794    0.0    0.0    0.0    1.0    1.0
oldpeak   303.0    1.039604   1.161075    0.0    0.0    0.8    1.6    6.2
slope     303.0    1.399340   0.616226    0.0    1.0    1.0    2.0    2.0
ca        303.0    0.729373   1.022606    0.0    0.0    0.0    1.0    4.0
thal      303.0    2.313531   0.612277    0.0    2.0    2.0    3.0    3.0
target    303.0    0.544554   0.498835    0.0    0.0    1.0    1.0    1.0

In [8]:
# Example of dropping 2 rows. You should rename the new DF, to keep the original data.
# uci_clean = uci.drop('thal', 'ca')

In [9]:
# Use the code below. How does the output differ from info() ?
print(type(uci.dtypes)) # Panda Series datatype
uci.dtypes # column names are the index of the Series

<class 'pandas.core.series.Series'>

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [10]:
uci.ca.mean() #uci.ca = a Series

0.7293729372937293

#### The Axis Variable

In [11]:
uci.sum() # Try [shift] + [tab] here!
# axis = 0 for index (rows), axis=1 for columns

age         16473.0
sex           207.0
cp            293.0
trestbps    39882.0
chol        74618.0
fbs            45.0
restecg       160.0
thalach     45343.0
exang          99.0
oldpeak       315.0
slope         424.0
ca            221.0
thal          701.0
target        165.0
dtype: float64

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [12]:
# list comprehension syntax: great when the output of a loop is a list (also tuple comprehension (): (code in here))
# lowercase and omit spaces
# can stack methods on top of each other

# uci.columns = ['uci_' + x.lower().replace(' ','') for x in uci.columns]
uci.columns = [x.lower().replace(' ','') for x in uci.columns]
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [13]:
# value counts (distribution) for a specific column
uci['age'].value_counts()[:10]
# top 10 ages with most observations

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

Exercise: What are the different values for restecg?

In [37]:
# Your code here!
uci['restecg'].value_counts()

1    152
0    147
2      4
Name: restecg, dtype: int64

In [39]:
# returns array of unique values
uci['restecg'].unique()

array([0, 1, 2])

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [40]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [41]:
animal_outcomes.shape

(111744, 12)

In [45]:
# non-null object usually refers to strings
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111744 entries, 0 to 111743
Data columns (total 12 columns):
Animal ID           111744 non-null object
Name                76505 non-null object
DateTime            111744 non-null object
MonthYear           111744 non-null object
Date of Birth       111744 non-null object
Outcome Type        111736 non-null object
Outcome Subtype     50868 non-null object
Animal Type         111744 non-null object
Sex upon Outcome    111740 non-null object
Age upon Outcome    111720 non-null object
Breed               111744 non-null object
Color               111744 non-null object
dtypes: object(12)
memory usage: 10.2+ MB

In [44]:
animal_outcomes.describe().T

                   count  unique                     top   freq
Animal ID         111744  100110                 A721033     33
Name               76505   18197                     Max    498
DateTime          111744   91885  04/18/2016 12:00:00 AM     39
MonthYear         111744   91885  04/18/2016 12:00:00 AM     39
Date of Birth     111744    6656              09/01/2015    118
Outcome Type      111736       9                Adoption  48777
Outcome Subtype    50868      22                 Partner  28010
Animal Type       111744       5                     Dog  63222
Sex upon Outcome  111740       5           Neutered Male  39112
Age upon Outcome  111720      50                  1 year  20161
Breed             111744    2504  Domestic Shorthair Mix  30466
Color             111744     580             Black/White  11695

In [48]:
animal_outcomes.Breed.value_counts()[:10]

Domestic Shorthair Mix       30466
Pit Bull Mix                  8136
Labrador Retriever Mix        6419
Chihuahua Shorthair Mix       6064
Domestic Shorthair            3975
Domestic Medium Hair Mix      3056
German Shepherd Mix           2796
Bat Mix                       1746
Domestic Longhair Mix         1507
Australian Cattle Dog Mix     1413
Name: Breed, dtype: int64

In [56]:
# Under the hood: creating 2 series of T/F for dog, adoption
# Then creates 3rd series where both are true
animal_outcomes.loc[(animal_outcomes.animaltype == 'Dog') & 
                    (animal_outcomes.outcometype == 'Adoption')].breed.value_counts()[:10]

Labrador Retriever Mix       3268
Pit Bull Mix                 3160
Chihuahua Shorthair Mix      2905
German Shepherd Mix          1413
Australian Cattle Dog Mix     797
Dachshund Mix                 495
Border Collie Mix             483
Boxer Mix                     426
Catahoula Mix                 343
Staffordshire Mix             340
Name: breed, dtype: int64

What are the breed `value_counts`?
What's the top breed for adopted dogs?

How about outcome counts for dogs?

In [ ]:
# top breed = domestic shorthair mix

In [52]:
animal_outcomes.columns = [x.lower().replace(' ','') for x in animal_outcomes.columns]

In [53]:
# age counts (age upon outcome) specifically for dogs
animal_outcomes.loc[animal_outcomes.animaltype == 'Dog'].ageuponoutcome.value_counts()[:10]
# animal_outcomes.loc[animal_outcomes['Animal Type' == 'Dog']]['Age upon Outcome'].value_counts()[:10]

1 year      12337
2 years     11504
3 years      5164
2 months     4901
4 years      3212
5 years      2931
6 years      1973
1 month      1961
7 years      1664
8 years      1587
Name: ageuponoutcome, dtype: int64

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [57]:
def successor(x):
    return x + 1

In [58]:
# .applymap is just like .apply but to entire dataframe
# applies +1 to every single entry in the dataframe
# would not work with string entries

uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2

In [ ]:
# Easy way to turn all data a specific data type
# to turn all data into strings:

# uci.applymap(str).info()

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [61]:
# A series does not have an .applymap function
uci['age'].map(successor).tail(10)

293    68
294    45
295    64
296    64
297    60
298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [19]:
# Lamdas are good for simple functions defined in a single line
uci['oldpeak'].map(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

Exercise: Use an anonymous function to turn the entries in age to strings

In [62]:
for x in map(successor, [1,2,3]):
    print(x)

2
3
4

In [64]:
uci.iloc[:,0:2]

     age  sex
0     63    1
1     37    1
2     41    0
3     56    1
4     57    0
..   ...  ...
298   57    0
299   45    1
300   68    1
301   57    1
302   57    0

[303 rows x 2 columns]

In [68]:
# 3 ways of turning age column into strings
uci['age'].apply(lambda x: str(x))
uci.age.apply(str)
uci.age.astype(str)

uci['age'].describe

<bound method NDFrame.describe of 0      63
1      37
2      41
3      56
4      57
       ..
298    57
299    45
300    68
301    57
302    57
Name: age, Length: 303, dtype: int64>

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [69]:
# Your code here
animal_outcomes.columns

Index(['animalid', 'name', 'datetime', 'monthyear', 'dateofbirth',
       'outcometype', 'outcomesubtype', 'animaltype', 'sexuponoutcome',
       'ageuponoutcome', 'breed', 'color'],
      dtype='object')

In [ ]:
animal_outcomes.datetime.apply(lambda x: pd.to_datetime(x)).head()
# animal_outomes.datetime.dtype

Or you can import datetime for datetime commands
Better option

In [73]:
animal_outcomes.ageuponoutcome.head()

0    4 months
1      6 days
2    2 months
3    2 months
4     2 years
Name: ageuponoutcome, dtype: object

In [78]:
animal_outcomes.ageuponoutcome.unique()

array(['4 months', '6 days', '2 months', '2 years', '7 years', '2 days',
       '9 months', '2 weeks', '3 months', '3 years', '7 months',
       '6 years', '4 years', '1 year', '12 years', '6 months', '9 years',
       '5 years', '5 months', '1 month', '1 week', '14 years', '1 weeks',
       '10 months', '8 years', '4 weeks', '3 weeks', '5 days', '15 years',
       '11 months', '0 years', '8 months', '11 years', '13 years',
       '16 years', '10 years', '1 day', '3 days', '4 days', '5 weeks',
       '17 years', '18 years', '20 years', '22 years', nan, '19 years',
       '-1 years', '-3 years', '25 years', '24 years', '21 years'],
      dtype=object)

In [79]:
def str_to_age(x):
    if isinstance(x, str):
        if 'years' in x:
            return int(x.split(' ')[0]) * 365
        if 'months' in x:
            return int(x.split(' ')[0]) * 30
        if 'weeks' in x:
            return int(x.split(' ')[0]) * 7
        else:
            return int(x.split(' '[0]))
    return x
animal_outcomes.ageuponoutcome.apply(str_to_age)

TypeError: int() argument must be a string, a bytes-like object or a number, not 'list'

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [21]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [22]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [23]:
uci.groupby('sex').get_group(0) # .tail()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
11,48,0,2,130,275,0,1,139,0,0.2,2,0,2,1
14,58,0,3,150,283,1,0,162,0,1.0,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
289,55,0,0,128,205,0,2,130,1,2.0,1,1,3,0
292,58,0,0,170,225,1,0,146,1,2.8,1,2,1,0
296,63,0,0,124,197,0,1,136,1,0.0,1,0,2,0
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Aggregating

In [24]:
uci.groupby('sex').std()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,9.409396,0.972427,19.311119,65.088946,0.332455,0.557150,20.047969,0.422503,1.119844,0.593736,0.881026,0.441290,0.435286
1,8.883803,1.059064,16.658246,42.782392,0.366955,0.510754,24.130882,0.484505,1.174632,0.627378,1.074082,0.659949,0.498626

Exercise: Tell me the average cholesterol level for those with heart disease.

In [25]:
# Your code here!

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [26]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [27]:
uci.pivot(values='sex', columns='target').head()

target   0    1
0      NaN  1.0
1      NaN  1.0
2      NaN  0.0
3      NaN  1.0
4      NaN  0.0

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [28]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'HP'])

In [29]:
toy1.join(toy2.set_index('age'),
          on='age',
          lsuffix='_A',
          rsuffix='_B').head()

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

### `.merge()`

In [30]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)

In [31]:
states = pd.read_csv('data/states.csv', index_col=0)

In [32]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

### `pd.concat()`

Exercise: Look up the documentation on pd.concat (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.
<br/>
Your result should still have only five rows!

In [33]:
pd.concat([ds_chars, states])

/Users/flatironschooldc2/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      HP     capital home_state    name   nickname state
0  200.0         NaN         WA    greg        NaN   NaN
1  200.0         NaN         WA   miles        NaN   NaN
2  170.0         NaN         TX    alan        NaN   NaN
3  300.0         NaN         DC  alison        NaN   NaN
4  200.0         NaN         TX  rachel        NaN   NaN
0    NaN     Olympia        NaN     NaN  evergreen    WA
1    NaN      Austin        NaN     NaN      alamo    TX
2    NaN  Washington        NaN     NaN   district    DC
3    NaN    Columbus        NaN     NaN    buckeye    OH
4    NaN       Salem        NaN     NaN     beaver    OR

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [34]:
ds_chars.head()

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [35]:
pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])

     name    variable value
0    greg          HP   200
1   miles          HP   200
2    alan          HP   170
3  alison          HP   300
4  rachel          HP   200
5    greg  home_state    WA
6   miles  home_state    WA
7    alan  home_state    TX
8  alison  home_state    DC
9  rachel  home_state    TX

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

The Url for the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

_Hints_ :
- import and clean the intake dataset first
- use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days-in-shelter variable
- Notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- Use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. We will use it in a later lecture!

use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [36]:
#code here